<a href="https://colab.research.google.com/github/Sharath2021/Oil-and-Natural-gas-price-Analysis/blob/main/Oil_%26_Natural_Gas_price_Analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [ ]:
brent_oil_prices=pd.read_excel("https://www.eia.gov/dnav/pet/hist_xls/RBRTEd.xls",sheet_name="Data 1",
                               skiprows=2455, names= ['Date', 'Brent_Price'])
wti_oil_prices=pd.read_excel("https://www.eia.gov/dnav/pet/hist_xls/RWTCd.xls",sheet_name="Data 1",
                               skiprows=2801, names= ['Date', 'wti_Price'])
gas_prices=pd.read_excel("https://www.eia.gov/dnav/ng/hist_xls/RNGWHHDd.xls",sheet_name="Data 1",
                               skiprows=2, names= ['Date', 'Henry_Hub_Price'])

In [ ]:
print(brent_oil_prices.shape)
print(wti_oil_prices.shape)
print(gas_prices.shape)

(6309, 2)
(6247, 2)
(6261, 2)

In [ ]:
brent_oil_prices.head()

        Date  Brent_Price
0 1997-01-07        24.76
1 1997-01-08        24.78
2 1997-01-09        24.83
3 1997-01-10        24.22
4 1997-01-13        23.41

In [ ]:
wti_oil_prices.head()

        Date  wti_Price
0 1997-01-07      26.25
1 1997-01-08      26.55
2 1997-01-09      26.30
3 1997-01-10      26.15
4 1997-01-13      25.20

In [ ]:
gas_prices.head()

        Date  Henry_Hub_Price
0 1997-01-07             3.82
1 1997-01-08             3.80
2 1997-01-09             3.61
3 1997-01-10             3.92
4 1997-01-13             4.00